Aspiring-Freeman/BT_NR_TRANSLATOR/VscodeGcc/FM33LE0XX.SVD
      </registers>
    </peripheral>
    <peripheral>
      <name>VREF</name>
      <description>VREF module information</description>
      <groupName>VREF</groupName>
      <baseAddress>0x4001a80c</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VREF</name>
        <description>VREF interrupt</description>
        <value>29</value>
      </interrupt>
      <registers>
        <register>
          <name>PTAT_CR</name>
          <displayName>PTAT_CR</displayName>
          <description>VREF PTAT Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PTAT_EN</name>
              <description>PTAT_EN field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFCR</name>
          <displayName>BUFCR</displayName>
          <description>Buffer Control Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VPTATBUFFER_OUTEN</name>
              <description>VPTATBUFFER_OUTEN field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPTATBUFFER_EN</name>
              <description>VPTATBUFFER_EN field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFFER_OUTEN</name>
              <description>VREFBUFFER_OUTEN field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREFBUFFER_EN</name>
              <description>VREFBUFFER_EN field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <description>DBG module information</description>
      <groupName>DBG</groupName>
      <baseAddress>0x40000004</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Debug Configuration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00003d03</resetValue>
          <fields>
            <field>
              <name>DBG_RCENB</name>
              <description>DBG_RCENB field description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AT_STOP</name>
              <description>AT_STOP field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPT_STOP</name>
              <description>LPT_STOP field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GT2_STOP</name>
              <description>GT2_STOP field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GT1_STOP</name>
              <description>GT1_STOP field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BT_STOP</name>
              <description>BT_STOP field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDT_STOP</name>
              <description>WWDT_STOP field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDT_STOP</name>
              <description>IWDT_STOP field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HDFR</name>
          <displayName>HDFR</displayName>
          <description>HardFault Flag Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DABORT_ADDR_FLAG</name>
              <description>DABORT_ADDR_FLAG field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DABORT_RESP_FLAG</name>
              <description>DABORT_RESP_FLAG field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SVCUNDEF_FLAG</name>
              <description>SVCUNDEF_FLAG field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPT_FLAG</name>
              <description>BKPT_FLAG field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBIT_FLAG</name>
              <description>TBIT_FLAG field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPECIAL_OP_FLAG</name>
              <description>SPECIAL_OP_FLAG field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDF_REQUEST_FLAG</name>
              <description>HDF_REQUEST_FLAG field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
